===
Empty struct definition
===

struct A {}

---

(chunk
  (struct_definition
    (identifier)))

===
Local empty struct declaration
===

local struct A {}

---

(chunk
  (struct_definition
    (identifier)))

===
Simple struct declaration
===

struct A {
	a: T
}

---

(chunk
  (struct_definition
    (identifier)
    (identifier)
    (identifier)))

===
Multiple members struct declaration
===

struct A {
	a: T
	b: S
}

---

(chunk
  (struct_definition
    (identifier)
    (identifier)
    (identifier)
    (identifier)
    (identifier)))

===
Multiple members inline struct declaration
===

struct A {a: T, b: S}

---

(chunk
  (struct_definition
    (identifier)
    (identifier)
    (identifier)
    (identifier)
    (identifier)))

===
Local struct declaration with members
===

local struct A {
	a: T
}

---

(chunk
  (struct_definition
    (identifier)
    (identifier)
    (identifier)))

===
Struct as table entry
===

struct S.A {
	a: T
	b: S
}

---

(chunk
  (struct_definition
    (dot_index_expression
      (identifier)
      (identifier))
    (identifier)
    (identifier)
    (identifier)
    (identifier)))

===
Struct with union
===

struct A {
	union {
		a: T
		b: S
	}
}

---

(chunk
  (struct_definition
    (identifier)
    (union_declaration
      (identifier)
      (identifier)
      (identifier)
      (identifier))))

===
Struct with mixed union and types
===

struct A {
	union {
		a: T
		b: S
	}
	c: U
}

---

(chunk
  (struct_definition
    (identifier)
    (union_declaration
      (identifier)
      (identifier)
      (identifier)
      (identifier))
    (identifier)
    (identifier)))

===
Struct with base class
===

struct A(B) {
	x: T
	y: S
}

---

(chunk
  (struct_definition
    (identifier)
	(base_struct
          (identifier))
    (identifier)
    (identifier)
    (identifier)
    (identifier)))

===
Struct with base class from table
===

struct A(C.B){
	re: T
	im: T
}

---

(chunk
  (struct_definition
    (identifier)
	(base_struct
          (dot_index_expression
            (identifier)
            (identifier)))
    (identifier)
    (identifier)
    (identifier)
    (identifier)))

===
Local struct with base class from table
===

local struct A(C.B){
	re: T
	im: T
}

---

(chunk
  (struct_definition
    (identifier)
	(base_struct
          (dot_index_expression
            (identifier)
            (identifier)))
    (identifier)
    (identifier)
    (identifier)
    (identifier)))

===
Struct declaration
===

struct A

---

(chunk
  (struct_declaration
    (identifier)))

===
Local struct declaration
===

local struct A

---

(chunk
  (struct_declaration
    (identifier)))

===
Empty anon struct
===

a = struct {}

---

(chunk
  (assignment_statement
    (variable_list
      (identifier))
    (expression_list
      (struct_definition))))

===
Anon struct
===

a = struct {x: T, y: S}

---

(chunk
  (assignment_statement
    (variable_list
      (identifier))
    (expression_list
      (struct_definition
        (identifier)
        (identifier)
        (identifier)
        (identifier)))))
