===
test statement
===

test a == b

---

(chunk
  (test_statement
    (binary_expression
      (identifier)
      (identifier))))

===
Empty testset
===

testset "Description" do end

---

(chunk
  (testset_statement
    (string
      (string_content))))

===
Testset with unit tests
===

testset "Long Description" do
  test a == b
  test foo(c)
end

---

(chunk
  (testset_statement
    (string
      (string_content))
    (block
      (test_statement
        (binary_expression
          (identifier)
          (identifier)))
      (test_statement
        (function_call
          (identifier)
          (arguments
            (identifier)))))))

===
Parametrized testset
===

testset(T, S) "Parametrized description" do
  test a == b
end

---

(chunk
  (testset_statement
    (arguments
      (identifier)
      (identifier))
    (string
      (string_content))
    (block
      (test_statement
        (binary_expression
          (identifier)
          (identifier))))))

===
Empty testenv
===

testenv "Description" do end

---

(chunk
  (testenv_statement
    (string
      (string_content))))

===
testenv with unit tests
===

testenv "Long Description" do
  test a == b
  test foo(c)
end

---

(chunk
  (testenv_statement
    (string
      (string_content))
    (block
      (test_statement
        (binary_expression
          (identifier)
          (identifier)))
      (test_statement
        (function_call
          (identifier)
          (arguments
            (identifier)))))))

===
Parametrized testenv
===

testenv(T, S) "Parametrized description" do
  test a == b
end

---

(chunk
  (testenv_statement
    (arguments
      (identifier)
      (identifier))
    (string
      (string_content))
    (block
      (test_statement
        (binary_expression
          (identifier)
          (identifier))))))

===
Terracode
===

terracode
  var a = 2
  var b: double = 3
end

---

(chunk
  (terracode_statement
    (block
      (terra_var_definition
        (terra_declaration
          (identifier))
        (number))
      (terra_var_definition
        (terra_declaration
          (identifier)
          (identifier))
        (number)))))


